Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G08B.tmx
Source language: en_us
Languages: zh_cn

source: Ten years at the top for Vladimir Putin
zh_cn: 普京的10年总统生涯

source: Much has changed in the 10 years since Vladimir Putin first became Russia's president.
zh_cn: 从普京第一次成为俄国总统后，十年内，他给俄国带来了很多变化。

source: He is now serving as prime minister with a possible view to running for the presidency again in 2012.
zh_cn: 现任俄国总统的他，在2012年有可能接任总理。

source: James Rodgers assesses the rise and rise of the spy who came to control the Kremlin.
zh_cn: 詹姆斯罗杰斯已经确定升任为总统，接管克林姆林宫。

source: Cast your mind back to 31 December 1999.
zh_cn: 回溯到1999年12月31日。

source: In Moscow, it is the last day of a century that has seen revolution and the collapse of communism.
zh_cn: 在莫斯科，在这个世纪的最后一天，人们看到一场重大变革，看到共产主义的崩塌。

source: Everyone in the Russian capital is waiting for reassurance from regions further east, where the new millennium has already started, that Russia's nuclear power stations are still safe - now that the date on their computers has changed to 2000.
zh_cn: 在俄国首都的每个人都等待着远东的消息。在那里，新的千年伊始，俄国的核电站仍在正常运转着，电脑上的日期已经跳至2000年。

source: The main news of the day comes as a surprise. Boris Yeltsin, Russia's first post-Soviet leader, announces his resignation.
zh_cn: 这一天人们获悉一条惊奇的消息：叶利钦，后苏联的第一任领导人，宣布辞职。

source: Vladimir Putin takes over as acting president.
zh_cn: 普京继任。

source: There is war in Chechnya. The economy is still reeling from Russia's defaulting on its debt a year earlier
zh_cn: 时值车臣战争不断，国家经济受制于前一年的债务而步履蹒跚。

source: Tough, and rough
zh_cn: 强势而粗暴

source: Mr Putin "came into a virtual failed state", says Sergei Karaganov, a former advisor to Mr Yeltsin, and now dean of Moscow's Higher School of Economics.
zh_cn: 普京“处在一个假想的失败状态”。 谢尔盖卡瓦格农说，叶利钦先生的前顾问，现任莫斯科高等经济学院院长。

source: He has watched both Mr Putin, and Russia, change.
zh_cn: 他认识到俄国和普京都在变化。

source: "He is bright, even brilliant, very tough, sometimes rough.
zh_cn: “他（普京）很聪明，甚至睿智，非常强硬，有时粗暴。

source: He is a street boy turned into a very sophisticated political functionary and manipulator."
zh_cn: 他从一个街头小伙成长为一个非常世故的政治官员和政治操纵者。

source: This description sums up Vladimir Putin's great versatility as a politician: he can seem equally comfortable wearing an expensive suit and discussing economic issues with world leaders, or sharing a joke with soldiers and speaking their slang.
zh_cn: 下面的这些描述或许可以概括，作为一个政治官员，普京的不凡才艺：穿着昂贵的衣服与各国领导人谈论经济问题；与士兵们分享幽默，讲行话俚语：他的一言一行看上去都很舒适。
